docs/hdfexample.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-13 Mon 14:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ZIO HDD5 File Service Example</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">ZIO HDD5 File Service Example</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org78d38a4">1. Running the example</a></li>
<li><a href="#orga91d7b7">2. Attribute matching protocol</a></li>
</ul>
</div>
</div>
<div class="nav">
<ul class="org-ul">
<li><a href="index.html">Main Page</a></li>
<li><a href="install.html">Installation</a></li>
<li><a href="tutorial.html">Tutorial</a></li>
<li><a href="howtos.html">How-to guides</a></li>
<li><a href="whytos.html">Design documents</a></li>
<li><a href="api.html">API Reference</a></li>
</ul>

</div>

<p>
In the <code>zio/python/example/</code> directory lives an example of how to
construct an HDF5 file service based on the <a href="flow-broker.html">flow broker</a> design.  This
document describes how it works.
</p>

<div id="outline-container-org78d38a4" class="outline-2">
<h2 id="org78d38a4"><span class="section-number-2">1</span> Running the example</h2>
<div class="outline-text-2" id="text-1">
<p>
A simple example that exercises the construction of ZIO messages from
protobuf objects and their deconstruction into HDF5 elements can be
run with:
</p>

<pre class="example">
$ python python/example/test_pbhdf.py
$ h5ls -r hpbhdf.hdf
</pre>

<p>
The <code>h5ls</code> program may be found in the <code>hdf5-tools</code> package.
</p>

<p>
TBD: full read/write service example.
</p>
</div>
</div>


<div id="outline-container-orga91d7b7" class="outline-2">
<h2 id="orga91d7b7"><span class="section-number-2">2</span> Attribute matching protocol</h2>
<div class="outline-text-2" id="text-2">
<p>
The example brings together arbitrary flow clients in some remote
application with arbitrary flow clients managing file resources.  In
order to decouple both sets, an <i>attribute matching protocol</i> is used.
This protocol is layered on top of the <b>BOT</b> protocol extension to the
basic <i>flow protocol</i> as described in <a href="flow-broker.html">flow broker</a>.
</p>

<p>
The attribute matching (AM) protocol works in this manner:
</p>

<ol class="org-ol">
<li>A remote flow client <b>asserts</b> a set of key/value attributes in its
<i>flow object</i> in its <b>BOT</b> message (in addition to those required by
the flow protocol).</li>
<li>A <b>broker</b> <b>factory</b> is configured with a set of <b>rules</b> which are
expressions in terms of the client attributes and the usual set of
Boolean, arithmetic and other operators.  If a rule evaluates to
true then an associated configuration is used to spawn a <b>handler</b>.</li>
</ol>

<p>
A rule is in the form of an <a href="https://en.wikipedia.org/wiki/S-expression">S-expression</a> for example, if the <b>BOT</b> has
an attribute <code>datatype</code> the following rule would evaluate <code>True</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(= datatype <span style="font-style: italic;">"wctzpb.Depo"</span>)
</pre>
</div>

<p>
The configuration associated with that rule would then be applied by
the <b>factory</b> in spawning a <b>handler</b>.
</p>
</div>
</div>
</div>
</body>
</html>
